app/views/teams/index.html.erb

                        <% team_num += 1 %>
                        <% team.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = $1  [["team_id", 9]]

                            <td> <%= user.email %> </td>
                            <td> <%= user.strengths.map(&:name).join(", ") %> </td>
---
SELECT "strengths".* FROM "strengths" INNER JOIN "strengths_users" ON "strengths"."id" = "strengths_users"."strength_id" WHERE "strengths_users"."user_id" = $1  [["user_id", 38]]

                          <th>Name</th>
                          <% Strength.order(:domain).each do |strength| %>
---
SELECT "strengths".* FROM "strengths" ORDER BY "strengths"."domain" ASC