team_sort/app/views/registrations/new.html.erb

            <div class="form-group">
              <%= f.collection_select :strength1, Strength.order(:name),:id,:name, {prompt: 'Strength 1'}, {class: 'form-control', required: true} %>
---
SELECT "strengths".* FROM "strengths" ORDER BY "strengths"."name" ASC