team_sort/app/controllers/groups_controller.rb

  def index
    @user = current_user
    @groups = @user.groups
---
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = $1  [["user_id", 33]]

  def edit
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def create
    create_params = group_params
    # generate random string for group code
    create_params[:code] = random_password(8)

    # Old PW generator
    #SecureRandom.base64(5)

    @group = Group.new(create_params)
    @group.users << current_user
---
INSERT INTO "groups" ("title", "code", "created_at", "updated_at", "hide_results") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TestTeam"], ["code", "BnfgIX0H"], ["created_at", "2019-04-09 17:31:35.408290"], ["updated_at", "2019-04-09 17:31:35.408290"], ["hide_results", "f"]]

  def update
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @group = Group.find(params[:id])

    teams = @group.teams
    teams.each do |team|
      team.users.each do |user|
        user.teams.delete(team)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."group_id" = $1  [["group_id", 20]]
SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = $1  [["team_id", 89]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 20]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 89]]

  def generate_teams
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def run_sort
    @group = Group.find(params[:id])
    byebug
    users = @group.users.where(admin: false)

    # remove the user from their team for this group in case we're doing a re-sort
    users.each do |user|
      team = user.teams.where(group_id: @group.id)
      user.teams.delete(team)
      user.save
    end

    team_size = group_params[:team_size].to_i
    user_count = users.count

    # if we're doing a re-sort we'll need to get rid of teams that were previously formed
    @group.teams.destroy_all

    # create teams
    team_num = user_count/team_size
    team_num.times do
      team = Team.new(score: 0)
      team.save
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = $1 AND "users"."admin" = $2 AND "users"."paid" = $3  [["group_id", 16], ["admin", "f"], ["paid", "t"]]
SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = $1  [["team_id", 81]]
SELECT "teams".* FROM "teams" INNER JOIN "teams_users" ON "teams"."id" = "teams_users"."team_id" WHERE "teams_users"."user_id" = $1 AND "teams"."group_id" = $2  [["user_id", 36], ["group_id", 16]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 9]]
UPDATE "teams" SET "score" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["score", 1], ["updated_at", "2019-02-04 05:01:32.559567"], ["id", 81]]
SELECT COUNT(*) FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = $1 AND "users"."admin" = $2  [["group_id", 16], ["admin", "f"]]
INSERT INTO "teams" ("score", "created_at", "updated_at", "group_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["score", 0], ["created_at", "2019-02-04 05:01:32.471395"], ["updated_at", "2019-02-04 05:01:32.471395"], ["group_id", 16]]

    strategic = find_strength(users, 'strategic thinking')
    users = users - strategic

    teams = @group.teams.order(:score)
---
SELECT "teams".* FROM "teams" WHERE "teams"."group_id" = $1 ORDER BY "teams"."score" ASC  [["group_id", 16]]

    def find_strength(users, strength)
      found = []
      count = 0
      users.each do |user|
        strengths = user.strengths
        strengths.each do |s|
---
SELECT "strengths".* FROM "strengths" INNER JOIN "strengths_users" ON "strengths"."id" = "strengths_users"."strength_id" WHERE "strengths_users"."user_id" = $1  [["user_id", 37]]