team_sort/app/controllers/teams_controller.rb

  def index
    group = Group.find(params[:group])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]