app/controllers/registrations_controller.rb

  def create
    build_resource(sign_up_params)

    code = sign_up_params[:code]
    admin = sign_up_params[:admin]
    @group = Group.where(code: code).first

    if (admin == 'true') or @group
      if resource.save
        # associate user with appropriate group
        if @group
          @group.users << resource

          strength_ids = [sign_up_params[:strength1], sign_up_params[:strength2], sign_up_params[:strength3],
                          sign_up_params[:strength4], sign_up_params[:strength5]]
          # strengths = []
          strength_ids.each do |s|
            # strengths << Strength.find(s)
            resource.strengths << Strength.find(s)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."code" = $1 ORDER BY "groups"."id" ASC LIMIT $2  [["code", "abc"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "admin", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "strengths".* FROM "strengths" WHERE "strengths"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]